eng_chars = {
    'A': ['𝒜', '𝑨', '𝓐', '𝖠', '𝔸', 'A̶', 'A̲'], 
    'B': ['𝐵', '𝑩', '𝓑', '𝖡', '𝔹', 'B̶', 'B̲'],
    'C': ['𝒞', '𝑪', '𝓒', '𝖢', 'ℂ', 'C̶', 'C̲'], 
    'D': ['𝒟', '𝑫', '𝓓', '𝖣', '𝔻', 'D̶', 'D̲'],
    'E': ['ℰ', '𝑬', '𝓔', '𝖤', '𝔼', 'E̶', 'E̲'], 
    'F': ['ℱ', '𝑭', '𝓕', '𝖥', '𝔽', 'F̶', 'F̲'],
    'G': ['𝒢', '𝑮', '𝓖', '𝖦', '𝔾', 'G̶', 'G̲'], 
    'H': ['ℋ', '𝑯', '𝓗', '𝖧', 'ℍ', 'H̶', 'H̲'],
    'I': ['ℐ', '𝑰', '𝓘', '𝖨', '𝕀', 'I̶', 'I̲'], 
    'J': ['𝒥', '𝑱', '𝓙', '𝖩', '𝕁', 'J̶', 'J̲'],
    'K': ['𝒦', '𝑲', '𝓚', '𝖪', '𝕂', 'K̶', 'K̲'], 
    'L': ['ℒ', '𝑳', '𝓛', '𝖫', '𝕃', 'L̶', 'L̲'],
    'M': ['ℳ', '𝑴', '𝓜', '𝖬', '𝕄', 'M̶', 'M̲'], 
    'N': ['𝒩', '𝑵', '𝓝', '𝖭', 'ℕ', 'N̶', 'N̲'],
    'O': ['𝒪', '𝑶', '𝓞', '𝖮', '𝕆', 'O̶', 'O̲'], 
    'P': ['𝒫', '𝑷', '𝓒', '𝖯', 'ℙ', 'P̶', 'P̲'],
    'Q': ['𝒬', '𝑸', '𝓠', '𝖰', 'ℚ', 'Q̶', 'Q̲'], 
    'R': ['ℛ', '𝑹', '𝓡', '𝖱', 'ℝ', 'R̶', 'R̲'],
    'S': ['𝒮', '𝑺', '𝓢', '𝖲', '𝕊', 'S̶', 'S̲'], 
    'T': ['𝒯', '𝑻', '𝓣', '𝖳', '𝕋', 'T̶', 'T̲'],
    'U': ['𝒰', '𝑼', '𝓤', '𝖴', '𝕌', 'U̶', 'U̲'], 
    'V': ['𝒱', '𝑽', '𝓥', '𝖵', '𝕍', 'V̶', 'V̲'],
    'W': ['𝒲', '𝑾', '𝓦', '𝖶', '𝕎', 'W̶', 'W̲'], 
    'X': ['𝒳', '𝑿', '𝓧', '𝖷', '𝕏', 'X̶', 'X̲'],
    'Y': ['𝒴', '𝒀', '𝓨', '𝖸', '𝕐', 'Y̶', 'Y̲'], 
    'Z': ['𝒵', '𝒁', '𝓩', '𝖹', 'ℤ', 'Z̶', 'Z̲'],
    
    # الحروف الصغيرة (Small letters)
    'a': ['𝒶', '𝒂', '𝓪', '𝖺', '𝕒', 'a̶', 'a̲'],
    'b': ['𝒷', '𝒃', '𝓫', '𝖻', '𝕓', 'b̶', 'b̲'],
    'c': ['𝒸', '𝒄', '𝓬', '𝖼', '𝕔', 'c̶', 'c̲'],
    # ... وتكمل بنفس المنطق لباقي الحروف
}


ar_styles = [
    "{}ـﮯ",          # 1. الياء الراجعة
    "عٌ{}ِّ",         # 2. تنقيط وحركات
    "{}ہٰ",           # 3. ستايل ملكي ناعم
    "{}ہليہ",        # 4. توزيع الهاء (عہليہ)
    "{}̷",            # 5. ستايل المشطب (ع̷ل̷ي̷)
    "؏ـ{}",           # 6. العين المزخرفة
    "{}ٰ",            # 7. الألف الخنجرية
    "{}ۦ",            # 8. رمز السكون الصغير
    "{}ـّ",           # 9. الشدة مع المد
    "{}ُ",            # 10. الضمة الخفيفة
    "{}َ",            # 11. الفتحة
    "{}ِ",            # 12. الكسرة
    "{}ْ",            # 13. السكون
    "{}ٓ",            # 14. علامة المد فوق الحرف
    "{}ً",            # 15. تنوين الفتح
    "{}ٍ",            # 16. تنوين الكسر
    "{}ٌ",            # 17. تنوين الضم
    "{}ـٰ",           # 18. مد مع ألف خنجرية
    "{}ـﮩ",          # 19. مد طويل مع هاء كوفية
    "{}ـہٰ"          # 20. مد مع هاء ملكية
]